## Introduction

## Methods and Results

In [1]:
library(broom)
library(repr)
library(infer)
library(gridExtra)
library(faraway)
library(mltools)
library(leaps)
library(dplyr)
library(glmnet)
library(cowplot)
library(modelr)
library(tidyverse)
library(caret)

salaries <- read_csv("data/ds_salaries.csv")

Attaching package: ‘dplyr’


The following object is masked from ‘package:gridExtra’:

    combine


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union


Loading required package: Matrix

Loaded glmnet 4.1-8


Attaching package: ‘modelr’


The following objects are masked from ‘package:mltools’:

    mse, rmse


The following object is masked from ‘package:broom’:

    bootstrap


── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ forcats   1.0.0     ✔ readr     2.1.5
✔ ggplot2   3.5.1     ✔ stringr   1.5.1
✔ lubridate 1.9.3     ✔ tibble    3.2.1
✔ purrr     1.0.2     ✔ tidyr     1.3.1
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ modelr::bootstrap() masks broom::bootstrap()
✖ dplyr::combine()    masks gridExtra::combine()
✖ tidyr::expand()     masks Matrix::expand()
✖ dplyr::filter()     masks stats::filter()
✖ dplyr::lag()        masks stats::lag()
✖ modelr::mse()       masks mltools::mse()
✖ tidyr::pack()       masks Matrix::pack()
✖ tidyr::replace_na() masks mltools::replace_na()
✖ modelr::rmse()      masks mltools::rmse()
✖ lubridate::stamp()  masks cowplot::stamp()
✖ tidyr::unpack()     masks Matrix::unpack()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
Loading required package: lattice


Attaching package: ‘lattice’


The following object is masked from ‘package:faraway’:

    melanoma



Attaching package: ‘caret’


The following object is masked from ‘package:purrr’:

    lift


New names:
• `` -> `...1`
Rows: 607 Columns: 12
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (7): experience_level, employment_type, job_title, salary_currency, empl...
dbl (5): ...1, work_year, salary, salary_in_usd, remote_ratio

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

### EDA

### Methods

In [5]:
# remove unnecessary variables
preprocessed_salaries <- salaries |>
  select(-c("...1", salary_currency, work_year, salary, employee_residence))

In [6]:
# feature engineering on company_location, job_title
no_am <- c("CA", "US", "MX", "HN")
so_am <- c("CL", "CO", "BR")
eur <- c("SI", "PL", "NL", "MT", "MO", "LU", "MD", "IT", "UA", 
         "IE", "HU", "HR", "GR", "GB", "FR", "ES", "EE", "DK", "DE", "AT", "BE", "CH", "CZ", "RO", "PT")
asia <- c("MY", "VN", "SG", "RU", "JP", "CN", "IN", "PK", "IL", "IQ", "IR", "TR", "AE")
afr <- c("KE", "DZ", "NG")
oce <- c("NZ", "AU", "AS")

In [7]:
# cont is the company location in terms of continent
preprocessed_salaries <- preprocessed_salaries %>%
    mutate(cont = "")

preprocessed_salaries[1, ]

  experience_level employment_type job_title      salary_in_usd remote_ratio
1 MI               FT              Data Scientist 79833         0
  company_location company_size cont
1 DE               L

In [9]:
for(i in 1:607){
    if(preprocessed_salaries[i, ]$company_location %in% no_am){
        preprocessed_salaries[i, ]$cont = "no_am"
    } else if(preprocessed_salaries[i, ]$company_location %in% so_am) {
        preprocessed_salaries[i, ]$cont = "so_am"
    } else if(preprocessed_salaries[i, ]$company_location %in% eur){
        preprocessed_salaries[i, ]$cont = "eur"
    } else if(preprocessed_salaries[i, ]$company_location %in% asia){
        preprocessed_salaries[i, ]$cont = "asia"
    } else if(preprocessed_salaries[i, ]$company_location %in% afr){
        preprocessed_salaries[i, ]$cont = "afr"
    } else if(preprocessed_salaries[i, ]$company_location %in% oce) {
        preprocessed_salaries[i, ]$cont = "oce"
    }
}

head(select(preprocessed_salaries, company_location, cont), 10)

   company_location cont
1  DE               eur
2  JP               asia
3  GB               eur
4  HN               no_am
5  US               no_am
6  US               no_am
7  US               no_am
8  HU               eur
9  US               no_am
10 NZ               oce

In [14]:
counts <- preprocessed_salaries %>%
    group_by(job_title) %>%
    summarize(counts = n())

counts

   job_title                                counts
1  3D Computer Vision Researcher              1
2  AI Scientist                               7
3  Analytics Engineer                         4
4  Applied Data Scientist                     5
5  Applied Machine Learning Scientist         4
6  BI Data Analyst                            6
7  Big Data Architect                         1
8  Big Data Engineer                          8
9  Business Data Analyst                      5
10 Cloud Data Engineer                        2
11 Computer Vision Engineer                   6
12 Computer Vision Software Engineer          3
13 Data Analyst                              97
14 Data Analytics Engineer                    4
15 Data Analytics Lead                        1
16 Data Analytics Manager                     7
17 Data Architect                            11
18 Data Engineer                            132
19 Data Engineering Manager                   5
20 Data Science Consultant                    7
21 Data Science Engineer                      3
22 Data Science Manager                      12
23 Data Scientist                           143
24 Data Specialist                            1
25 Director of Data Engineering               2
26 Director of Data Science                   7
27 ETL Developer                              2
28 Finance Data Analyst                       1
29 Financial Data Analyst                     2
30 Head of Data                               5
31 Head of Data Science                       4
32 Head of Machine Learning                   1
33 Lead Data Analyst                          3
34 Lead Data Engineer                         6
35 Lead Data Scientist                        3
36 Lead Machine Learning Engineer             1
37 ML Engineer                                6
38 Machine Learning Developer                 3
39 Machine Learning Engineer                 41
40 Machine Learning Infrastructure Engineer   3
41 Machine Learning Manager                   1
42 Machine Learning Scientist                 8
43 Marketing Data Analyst                     1
44 NLP Engineer                               1
45 Principal Data Analyst                     2
46 Principal Data Engineer                    3
47 Principal Data Scientist                   7
48 Product Data Analyst                       2
49 Research Scientist                        16
50 Staff Data Scientist                       1

In [35]:
# field will contain the job_title groupings
preprocessed_salaries <- preprocessed_salaries %>%
    mutate(field = "")

preprocessed_salaries[1, ]

  experience_level employment_type job_title      salary_in_usd remote_ratio
1 MI               FT              Data Scientist 79833         0
  company_location company_size cont field
1 DE               L            eur

In [38]:
for(i in 1:607){
    if(str_detect(preprocessed_salaries$job_title[i], "Data Scien")) {
        preprocessed_salaries$field[i] = "Data Science"
    } else if(str_detect(preprocessed_salaries$job_title[i], "Data Analy")) {
        preprocessed_salaries$field[i] = "Data Analysis"       
    } else if(str_detect(preprocessed_salaries$job_title[i], "Machine Learning") || str_detect(preprocessed_salaries$job_title[i], "ML")){
        preprocessed_salaries$field[i] = "Machine Learning"
    } else if(str_detect(preprocessed_salaries$job_title[i], "Data Engineer")) {
        preprocessed_salaries$field[i] = "Data Engineering"
    } else {
        preprocessed_salaries$field[i] = "Other"
    }
}

head(select(preprocessed_salaries, job_title, field), 20)

   job_title                  field
1  Data Scientist             Data Science
2  Machine Learning Scientist Machine Learning
3  Big Data Engineer          Data Engineering
4  Product Data Analyst       Data Analysis
5  Machine Learning Engineer  Machine Learning
6  Data Analyst               Data Analysis
7  Lead Data Scientist        Data Science
8  Data Scientist             Data Science
9  Business Data Analyst      Data Analysis
10 Lead Data Engineer         Data Engineering
11 Data Scientist             Data Science
12 Data Scientist             Data Science
13 Data Scientist             Data Science
14 Lead Data Analyst          Data Analysis
15 Data Analyst               Data Analysis
16 Data Analyst               Data Analysis
17 Data Engineer              Data Engineering
18 Big Data Engineer          Data Engineering
19 Data Science Consultant    Data Science
20 Lead Data Engineer         Data Engineering

In [41]:
# Remove job_title and company_location
feat_salaries <- preprocessed_salaries %>%
    select(-job_title, -company_location)

# Convert all string parameters to factors
feat_salaries$company_size <- as.factor(feat_salaries$company_size)
feat_salaries$cont <- as.factor(feat_salaries$cont)
feat_salaries$field <- as.factor(feat_salaries$field)
head(feat_salaries)

  experience_level employment_type salary_in_usd remote_ratio company_size
1 MI               FT               79833          0          L
2 SE               FT              260000          0          S
3 SE               FT              109024         50          M
4 MI               FT               20000          0          S
5 SE               FT              150000         50          L
6 EN               FT               72000        100          L
  cont  field
1 eur   Data Science
2 asia  Machine Learning
3 eur   Data Engineering
4 no_am Data Analysis
5 no_am Machine Learning
6 no_am Data Analysis

In [6]:
# forward selection

In [7]:
# model comparison

## Discussion

## References